"""
Лаба 5 створюєм рпг гру ти головний герой алхімік в тебе є інвентар обмежений 10 слотами під зілля та окремий інвентар обежений 25 слотами під інгридієнти.
+ 5 інгридієнтів видається кожен ігровий день. в кінці дня ти можеш продати зроблені зілля.
Зілля одного виду стакаються по 10 в слоті інвентаря. інгридієнти по 25 в слоті одного інгридієнту.
Мінімальний пул інгридієнтів 200 різних. пул для зілля 50. придумати логічну кінцівку( виграш або програш гри)
Максимально все має бути побудоване по блоках трай ексепт.
Окремі за логікою функції мають бути розбиті на окремі файли. Залити до 25 жовтня
"""

from ingradiens import create_ingredient_pool  # функція створення списку інгредієнтів
from potions import create_potion_pool  # функція створення списку зілль
from game import game_loop  # головний цикл гри


def main():  # головна функція програми
    try:  # пробуємо виконати код
        ingredient_pool = create_ingredient_pool()  # створюємо 200 інгредієнтів
        potion_pool = create_potion_pool()  # створюємо 50 зілль
        print("Ти алхімік. Назбирай золото, варячи й продаючи зілля!")  # вступний текст
        game_loop(ingredient_pool, potion_pool)  # запускаємо гру
    except KeyboardInterrupt:  # якщо гравець натиснув Ctrl+C
        print("\nГру перервано.")  # ввічливо виходимо
    except Exception as e:  # будь-яка інша помилка
        print("Критична помилка:", e)  # виводимо повідомлення про помилку


if __name__ == "__main__":  # перевірка: файл запущено напряму, а не імпортовано
    main()  # тоді запускаємо головну функцію